Tekla Open API Reference for Tekla Structures 2025
Operation.UnselectedModeEnum Enumeration
Specifies what ShowOnlySelected(Operation.UnselectedModeEnum) should do to unselected parts.
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum UnselectedModeEnum
Public Enumeration UnselectedModeEnum
Members
Member name | Value | Description
Hidden | 0 | Completely hide.
Transparent | 1 | Make almost transparent.
AsSticks | 2 | Show as sticks.
See Also
Reference
Tekla.Structures.Model.Operations Namespace